FIELD_SIDE = 4
FIELD_SIZE = FIELD_SIDE * FIELD_SIDE
SOLVE_INTERVAL = 400
MIN_TO_SEC = 60
SEC_TO_MS = 1000
RIGHT = +1
LEFT = -1
UP = -FIELD_SIDE
DOWN = +FIELD_SIDE
DIRECTIONS = [RIGHT, LEFT, UP, DOWN]
BLOCKED_STYLESHEET = "color: rgb(119, 118, 123); background-color: rgb(192, 191, 188);"
START_GAME_HINT = "Натисніть на кнопку \"Почати нову гру\", щоб почати"
REBASE_HINT_TEXT = "Натисніть по черзі на дві клітинки, щоб поміняти їх місцями. " \
                    "Натисніть на кнопку \"Почати нову гру\", щоб розпочати"
UNSOLVABLE_HINT_TEXT = "Пазл неможливо розвʼязати. Спробуйте " \
                       "змінити порядок розташування натисканням " \
                       "на клітинки"
SORTED_HINT_TEXT = "Здається, що пазл вже складено, Змініть розташування " \
                   "натисканням на клітинки, які хочете поміняти місцями"
INGAME_HINT = "Переміщуйте клітинки, допоки поле не буде у відсортованому стані " \
              "з пробілом у правому нижньому кутку"
SOLVER_HINT = "Відбувається автоматичне розвʼязування, натисніть на кнопку " \
              "\"Зупинити\", щоб вимкнути його"
